#!/usr/bin/env python3
# _*_ coding:utf-8 _*_
import datetime

version='V 3.0'

banner='''

鈻堚枅鈺?    鈻堚枅鈺椻枅鈻堚枅鈻堚枅鈻堚晽 鈻堚枅鈻堚枅鈻堚枅鈺? 鈻堚枅鈻堚枅鈻堚晽 
鈻堚枅鈺?    鈻堚枅鈺戔枅鈻堚晹鈺愨晲鈻堚枅鈺椻枅鈻堚晹鈺愨晲鈻堚枅鈺椻枅鈻堚晹鈺愨晲鈻堚枅鈺?
鈻堚枅鈺?    鈻堚枅鈺戔枅鈻堚枅鈻堚枅鈻堚晹鈺濃枅鈻堚枅鈻堚枅鈻堚晹鈺濃枅鈻堚枅鈻堚枅鈻堚枅鈺?
鈻堚枅鈺?    鈻堚枅鈺戔枅鈻堚晹鈺愨晲鈻堚枅鈺椻枅鈻堚晹鈺愨晲鈻堚枅鈺椻枅鈻堚晹鈺愨晲鈻堚枅鈺?
鈻堚枅鈻堚枅鈻堚枅鈻堚晽鈻堚枅鈺戔枅鈻堚枅鈻堚枅鈻堚晹鈺濃枅鈻堚晳  鈻堚枅鈺戔枅鈻堚晳  鈻堚枅鈺?
鈺氣晲鈺愨晲鈺愨晲鈺愨暆鈺氣晲鈺濃暁鈺愨晲鈺愨晲鈺愨暆 鈺氣晲鈺? 鈺氣晲鈺濃暁鈺愨暆  鈺氣晲鈺?

          Orion | 缃戠珯浜戠洃娴嬬爺鍒ょ郴缁?
          By RabbitMask | {}
'''.format(version)

banner2 = '''


鈻堚枅鈺?    鈻堚枅鈺椻枅鈻堚枅鈻堚枅鈻堚晽 鈻堚枅鈻堚枅鈻堚枅鈺? 鈻堚枅鈻堚枅鈻堚晽
鈻堚枅鈺?    鈻堚枅鈺戔枅鈻堚晹鈺愨晲鈻堚枅鈺椻枅鈻堚晹鈺愨晲鈻堚枅鈺椻枅鈻堚晹鈺愨晲鈻堚枅鈺?
鈻堚枅鈺?    鈻堚枅鈺戔枅鈻堚枅鈻堚枅鈻堚晹鈺濃枅鈻堚枅鈻堚枅鈻堚晹鈺濃枅鈻堚枅鈻堚枅鈻堚枅鈺?
鈻堚枅鈺?    鈻堚枅鈺戔枅鈻堚晹鈺愨晲鈻堚枅鈺椻枅鈻堚晹鈺愨晲鈻堚枅鈺椻枅鈻堚晹鈺愨晲鈻堚枅鈺?
鈻堚枅鈻堚枅鈻堚枅鈻堚晽鈻堚枅鈺戔枅鈻堚枅鈻堚枅鈻堚晹鈺濃枅鈻堚晳  鈻堚枅鈺戔枅鈻堚晳  鈻堚枅鈺?
鈺氣晲鈺愨晲鈺愨晲鈺愨暆鈺氣晲鈺濃暁鈺愨晲鈺愨晲鈺愨暆 鈺氣晲鈺? 鈺氣晲鈺濃暁鈺愨暆  鈺氣晲鈺?

          Orion | 缃戠珯浜戠洃娴嬬爺鍒ゆ姤鍛?
          By RabbitMask | {}


    '''.format(datetime.datetime.now().strftime("%Y-%m-%d"))

def Orion_banner():
    print(banner)

def Orion_banner2():
    print('```')
    print(banner2)
    print('```')

if __name__ == '__main__':
    print(banner)
